<?php

/*
 1. С помощью цикла while вывести все числа в промежутке от 0 до 100,
 которые делятся на 3 без остатка
*/

$i = 1;

while ($i < 100) {
    if ($i % 3 == 0) {
        echo $i++ . ' ';
    }
    $i++;
}

echo '<hr>';

/*
2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
0 – ноль.
1 – нечетное число.
2 – четное число.
3 – нечетное число.
…
10 – четное число.
*/

$i = 0;

do {
    if ($i == 0) {
        echo $i . ' – это ноль ' . '<br>';
        $i++;
    } elseif ($i % 2 == 0) {
        echo $i . ' – нечетное число ' . '<br>';
        $i++;
    } else {
        echo $i . ' – четное число ' . '<br>';
        $i++;
    }

} while ($i <= 10);

echo '<hr>';

/*
 3. Объявить массив, в котором в качестве ключей будут использоваться названия областей,
 а в качестве значений – массивы с названиями городов из соответствующей области.
 Вывести в цикле значения массива, чтобы результат был таким:
 Московская область:
 Москва, Зеленоград, Клин
 Ленинградская область:
 Санкт-Петербург, Всеволожск, Павловск, Кронштадт
 Рязанская область … (названия городов можно найти на maps.yandex.ru)
 */

$array = [
    "Московская область" => ["Mосква", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволжск", "Павловск", "Кронштадт"],
    "Рязанская область" => ["Касимов", "Кораблино", "Михайлов"]
];

foreach ($array as $region => $city) {
    echo ("<p>$region :</p>");
        foreach ($city as $key => $city)

            echo("$city, ");
}

echo '<hr>';

/*
 4. Объявить массив, индексами которого являются буквы русского языка,
 а значениями – соответствующие латинские буквосочетания
 (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
 Написать функцию транслитерации строк.
 */

function  inter ( $str ) {
    $letters = [
        "а" => "a" ,
        "б" => "b" ,
        "в" => "v" ,
        "г" => "g" ,
        "д" => "d" ,
        "е" => "е" ,
        "ё" => "yo" ,
        "ж" => "zh" ,
        "з" => "z" ,
        "и" => "i" ,
        "й" => "y" ,
        "к" => "k" ,
        "л" => "l" ,
        "м" => "m" ,
        "н" => "n" ,
        "о" => "o" ,
        "п" => "p" ,
        "р" => "r" ,
        "с" => "s" ,
        "т" => "т" ,
        "у" => "u" ,
        "ф" => "f" ,
        "х" => "h" ,
        "ц" => "ts" ,
        "ч" => "ch" ,
        "ш" => "sh" ,
        "щ" => "shch" ,
        "ъ" => "" ,
        "ы" => "y" ,
        "ь" => "'" ,
        "э" => "е" ,
        "ю" => "yu" ,
        "я" => "ya" ,
    ];

    $text =  strtr ($str, $letters);
    echo  "$text";
};

inter ("доброе утро, помыть окно, съесть яблоко");

echo '<hr>';

/*
 5. Написать функцию, которая заменяет в строке пробелы на
 подчеркивания и возвращает видоизмененную строчку.
 */

function  replace ( $str ) {
    $letters = [
        " " => "_",
    ];

    $text =  strtr ($str, $letters);
    echo  "$text";
};

replace ( "Утром рано солнце встало" );

echo '<hr>';

/*
 6. В имеющемся шаблоне сайта заменить статичное меню (ul – li) на генерируемое через PHP.
 Необходимо представить пункты меню как элементы массива и вывести их циклом.
 Подумать, как можно реализовать меню с вложенными подменю?
 Попробовать его реализовать.
  */

?>
